Cases/container/carrier_test3/system/ground/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


T
{
    internalField   uniform 285;

    boundaryField
    {
            // ".*"
            // {
            //     type    zeroGradient;
            //     value   $internalField;
            // }

        ground_to_airOutside
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            qrNbr           qr;
            qr              none;
            kappa           none;
            thermalInertia  true;
            value           $internalField;
        }
        bottom
        {
            type            externalWallHeatFluxTemperature;
            mode            coefficient;
            Ta              uniform 313.0;
            h               uniform 10e5;
            kappaMethod     solidThermo;
            kappa           none;
            thicknessLayers (1 2);
            kappaLayers     (100 200);
            value           uniform 300.0;
        }
    }
}

// ************************************************************************* //
